docs/produkte/silverdat-calculatepro-si/schnittstellenoperat/request-getloc-2475.md

---
title: "Request getLockedInfo"
topic_id: "2475"
breadcrumb: "SilverDAT Produkte > SilverDAT calculatePro / SilverDAT calculateExpert > Schnittstellenoperationen > VehicleRepairService > Abfrage des Bearbeitungsstatus/ -benutzer eines Vorgangs > Request getLockedInfo"
---

# Request getLockedInfo

```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:veh="http://sphinx.dat.de/services/VehicleRepairService">
   <soapenv:Header/>
   <soapenv:Body>
      <veh:getLockedInfo>
         <contractID>999999</contractID>
      </veh:getLockedInfo>
   </soapenv:Body>
</soapenv:Envelope>
```
