docs/produkte/silverdat-calculatepro-si/schnittstellenoperat/request-getcon-2463.md

---
title: "Request getContractPriceGenerations"
topic_id: "2463"
breadcrumb: "SilverDAT Produkte > SilverDAT calculatePro / SilverDAT calculateExpert > Schnittstellenoperationen > VehicleRepairService > Abruf aller vorhandenen Preisständen eines Vorgangs > Request getContractPriceGenerations"
---

# Request getContractPriceGenerations

```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:veh="http://sphinx.dat.de/services/VehicleRepairService">
   <soapenv:Header/>
   <soapenv:Body>
      <veh:getContractPriceGenerations>
         <contractID>999999</contractID>
      </veh:getContractPriceGenerations>
   </soapenv:Body>
</soapenv:Envelope>
```
